-----------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/apanta1/Documents/ECON 31/FINAL PROJECT/PS_3.log
  log type:  text
 opened on:  23 Dec 2023, 21:59:46

. 
. // Load data
. import delimited "/Users/apanta1/Documents/ECON 31/FINAL PROJECT/Projectdata.csv", clea
> r
(encoding automatically selected: ISO-8859-1)
(10 vars, 143 obs)

. 
. 
. rename onascalefrom15towhatextenthasthe career_score

. rename onascalefrom15howwouldyoudescrib personality_score

. rename onascalefrom15howmuchdoyourfamil family_score

. rename areuaninternationalstudent international

. rename currentmajorprimarymajor major

. rename howmanytimeshaveyouchangedyourma major_change

. 
. gen international_num = 1

. replace international_num = 0 if international == "No"
(98 real changes made)

. 
. gen male_num = 0

. replace male_num = 1 if gender == "Male"
(73 real changes made)

. 
. gen female_num = 0

. replace female_num = 1 if gender == "Female"
(56 real changes made)

. 
. gen non_binary_num = 1

. replace non_binary_num = 0 if gender == "Male"
(73 real changes made)

. replace non_binary_num = 0 if gender == "Male"
(0 real changes made)

. 
. ttest career_score, by (international_num)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
       0 |      98    4.102041    .0988997    .9790569    3.905752    4.298329
       1 |      45    3.844444    .1879059    1.260511    3.465745    4.223144
---------+--------------------------------------------------------------------
Combined |     143    4.020979    .0901253    1.077742    3.842818     4.19914
---------+--------------------------------------------------------------------
    diff |            .2575964    .1935474               -.1250336    .6402263
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   1.3309
H0: diff = 0                                     Degrees of freedom =      141

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.9073         Pr(|T| > |t|) = 0.1854          Pr(T > t) = 0.0927

. /* fail to reject the null hypothesis here as both
> groups (domestic and international) are no different when it
> comes to career concerns */
. 
. ttest family_score, by (international_num)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
       0 |      98    2.979592    .1178205    1.166364    2.745751    3.213433
       1 |      45    2.688889    .1820817    1.221441    2.321927    3.055851
---------+--------------------------------------------------------------------
Combined |     143    2.888112    .0992957    1.187404    2.691823    3.084401
---------+--------------------------------------------------------------------
    diff |            .2907029    .2131752               -.1307298    .7121357
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   1.3637
H0: diff = 0                                     Degrees of freedom =      141

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.9126         Pr(|T| > |t|) = 0.1748          Pr(T > t) = 0.0874

. /* fail to reject the null hypothesis here as both
> groups (domestic and international) are no different when it
> comes to family's influence in major*/
. 
. 
.  ttest personality_score, by (international_num)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
       0 |      98    2.755102     .101598    1.005769    2.553458    2.956746
       1 |      45    2.733333    .1504203     1.00905    2.430181    3.036486
---------+--------------------------------------------------------------------
Combined |     143    2.748252    .0838997    1.003294    2.582398    2.914106
---------+--------------------------------------------------------------------
    diff |            .0217687    .1812965                -.336642    .3801794
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   0.1201
H0: diff = 0                                     Degrees of freedom =      141

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.5477         Pr(|T| > |t|) = 0.9046          Pr(T > t) = 0.4523

.  /* fail to reject the null hypothesis here as both
> groups (domestic and international) are no different when it
> comes to personality*/
. 
. 
. ttest career_score, by (female_num)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
       0 |      87    4.034483    .1126202    1.050451    3.810601    4.258364
       1 |      56           4    .1507557    1.128152    3.697879    4.302121
---------+--------------------------------------------------------------------
Combined |     143    4.020979    .0901253    1.077742    3.842818     4.19914
---------+--------------------------------------------------------------------
    diff |            .0344828    .1852723                -.331788    .4007535
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   0.1861
H0: diff = 0                                     Degrees of freedom =      141

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.5737         Pr(|T| > |t|) = 0.8526          Pr(T > t) = 0.4263

. /* fail to reject the null hypothesis here as both
> groups (female and non_female) are no different when it
> comes to career concerns */
. 
. ttest family_score, by (female_num)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
       0 |      87    2.770115    .1231125    1.148317    2.525375    3.014854
       1 |      56    3.071429    .1648635    1.233725    2.741035    3.401822
---------+--------------------------------------------------------------------
Combined |     143    2.888112    .0992957    1.187404    2.691823    3.084401
---------+--------------------------------------------------------------------
    diff |           -.3013136    .2025659               -.7017726    .0991453
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -1.4875
H0: diff = 0                                     Degrees of freedom =      141

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0696         Pr(|T| > |t|) = 0.1391          Pr(T > t) = 0.9304

. /* fail to reject the null hypothesis here as both
> groups (female and non_female) are no different when it
> comes to family's influence in major */
. 
. ttest personality_score, by (female_num)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
       0 |      87    2.678161    .1161789    1.083644    2.447205    2.909117
       1 |      56    2.857143    .1151751    .8618916    2.626327    3.087959
---------+--------------------------------------------------------------------
Combined |     143    2.748252    .0838997    1.003294    2.582398    2.914106
---------+--------------------------------------------------------------------
    diff |           -.1789819    .1718355               -.5186889     .160725
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -1.0416
H0: diff = 0                                     Degrees of freedom =      141

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.1497         Pr(|T| > |t|) = 0.2994          Pr(T > t) = 0.8503

. /* fail to reject the null hypothesis here as both
> groups (female and non_female) are no different when it
> comes to personality */
. 
. 
. /*testing if career_score, personality_score and family_score
> are different for seniors*/
. gen senior = 0

. replace senior = 1 if classyear == 2024
(28 real changes made)

. 
. ttest career_score, by (senior)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
       0 |     115    4.052174    .0979138    1.050008    3.858207     4.24614
       1 |      28    3.892857    .2261905    1.196887    3.428753    4.356962
---------+--------------------------------------------------------------------
Combined |     143    4.020979    .0901253    1.077742    3.842818     4.19914
---------+--------------------------------------------------------------------
    diff |            .1593168    .2275285               -.2904916    .6091251
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   0.7002
H0: diff = 0                                     Degrees of freedom =      141

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.7575         Pr(|T| > |t|) = 0.4850          Pr(T > t) = 0.2425

. ttest family_score, by (senior)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
       0 |     115    2.921739    .1091873    1.170903     2.70544    3.138038
       1 |      28        2.75     .239184    1.265643    2.259235    3.240765
---------+--------------------------------------------------------------------
Combined |     143    2.888112    .0992957    1.187404    2.691823    3.084401
---------+--------------------------------------------------------------------
    diff |            .1717391    .2506985               -.3238745    .6673528
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   0.6850
H0: diff = 0                                     Degrees of freedom =      141

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.7528         Pr(|T| > |t|) = 0.4944          Pr(T > t) = 0.2472

. ttest personality_score, by (senior)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
       0 |     115    2.765217    .0967279    1.037291      2.5736    2.956835
       1 |      28    2.678571    .1630851    .8629652    2.343948    3.013194
---------+--------------------------------------------------------------------
Combined |     143    2.748252    .0838997    1.003294    2.582398    2.914106
---------+--------------------------------------------------------------------
    diff |             .086646    .2120538               -.3325698    .5058617
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   0.4086
H0: diff = 0                                     Degrees of freedom =      141

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.6583         Pr(|T| > |t|) = 0.6835          Pr(T > t) = 0.3417

. 
. //fail to reject all three null hypothesis
. 
. /*testing if career_score, personality_score and family_score
> are different for first_year*/
. gen first_year = 0

. replace first_year = 1 if classyear == 2027
(25 real changes made)

. 
. ttest career_score, by (first_year)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
       0 |     118    4.016949     .100688    1.093751    3.817542    4.216356
       1 |      25        4.04    .2039608    1.019804    3.619046    4.460954
---------+--------------------------------------------------------------------
Combined |     143    4.020979    .0901253    1.077742    3.842818     4.19914
---------+--------------------------------------------------------------------
    diff |           -.0230508     .238118               -.4937937     .447692
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -0.0968
H0: diff = 0                                     Degrees of freedom =      141

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.4615         Pr(|T| > |t|) = 0.9230          Pr(T > t) = 0.5385

. ttest family_score, by (first_year)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
       0 |     118    2.864407     .113493     1.23285     2.63964    3.089174
       1 |      25           3    .1914854    .9574271    2.604794    3.395206
---------+--------------------------------------------------------------------
Combined |     143    2.888112    .0992957    1.187404    2.691823    3.084401
---------+--------------------------------------------------------------------
    diff |           -.1355932    .2621068               -.6537605     .382574
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -0.5173
H0: diff = 0                                     Degrees of freedom =      141

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.3029         Pr(|T| > |t|) = 0.6057          Pr(T > t) = 0.6971

. ttest personality_score, by (first_year)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
       0 |     118    2.779661    .0909776    .9882696    2.599485    2.959837
       1 |      25         2.6    .2160247    1.080123    2.154147    3.045853
---------+--------------------------------------------------------------------
Combined |     143    2.748252    .0838997    1.003294    2.582398    2.914106
---------+--------------------------------------------------------------------
    diff |             .179661    .2211597               -.2575565    .6168785
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   0.8124
H0: diff = 0                                     Degrees of freedom =      141

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.7910         Pr(|T| > |t|) = 0.4180          Pr(T > t) = 0.2090

. 
. //fail to reject all three null hypothesis
. 
. 
. /*testing if career_score, personality_score and family_score
> are different for natural_science majors*/
. gen natural_science = 0

. replace natural_science = 1 if division == "NSE"
(68 real changes made)

. 
. ttest career_score, by (natural_science)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
       0 |      75    3.906667    .1344637     1.16449    3.638742    4.174591
       1 |      68    4.147059    .1171522    .9660615    3.913222    4.380896
---------+--------------------------------------------------------------------
Combined |     143    4.020979    .0901253    1.077742    3.842818     4.19914
---------+--------------------------------------------------------------------
    diff |           -.2403922    .1799708               -.5961821    .1153978
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -1.3357
H0: diff = 0                                     Degrees of freedom =      141

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0919         Pr(|T| > |t|) = 0.1838          Pr(T > t) = 0.9081

. ttest family_score, by (natural_science)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
       0 |      75        2.92    .1455155    1.260202    2.630054    3.209946
       1 |      68    2.852941    .1345899    1.109857    2.584299    3.121584
---------+--------------------------------------------------------------------
Combined |     143    2.888112    .0992957    1.187404    2.691823    3.084401
---------+--------------------------------------------------------------------
    diff |            .0670588    .1994537               -.3272474     .461365
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   0.3362
H0: diff = 0                                     Degrees of freedom =      141

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.6314         Pr(|T| > |t|) = 0.7372          Pr(T > t) = 0.3686

. 
. // fail to reject above two hypothesis
. 
. ttest personality_score, by (natural_science)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
       0 |      75    2.946667    .1168557       1.012    2.713827    3.179507
       1 |      68    2.529412    .1156548    .9537137    2.298564     2.76026
---------+--------------------------------------------------------------------
Combined |     143    2.748252    .0838997    1.003294    2.582398    2.914106
---------+--------------------------------------------------------------------
    diff |            .4172549    .1648929                 .091273    .7432368
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   2.5305
H0: diff = 0                                     Degrees of freedom =      141

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.9938         Pr(|T| > |t|) = 0.0125          Pr(T > t) = 0.0062

. // we can successfully reject the hypothesis
. //successsss
. 
. 
. /*testing if career_score and family_score
> are different for introvert*/
. gen introvert  = 0

. replace introvert = 1 if personality_score < 3
(62 real changes made)

. 
. ttest career_score, by (introvert)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
       0 |      81    4.148148    .1112653    1.001388    3.926723    4.369573
       1 |      62    3.854839    .1469715    1.157255    3.560951    4.148726
---------+--------------------------------------------------------------------
Combined |     143    4.020979    .0901253    1.077742    3.842818     4.19914
---------+--------------------------------------------------------------------
    diff |            .2933094    .1808276               -.0641743    .6507932
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   1.6220
H0: diff = 0                                     Degrees of freedom =      141

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.9465         Pr(|T| > |t|) = 0.1070          Pr(T > t) = 0.0535

. ttest family_score, by (introvert)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
       0 |      81    2.938272    .1330387    1.197348    2.673516    3.203027
       1 |      62    2.822581    .1499589    1.180778    2.522719    3.122442
---------+--------------------------------------------------------------------
Combined |     143    2.888112    .0992957    1.187404    2.691823    3.084401
---------+--------------------------------------------------------------------
    diff |             .115691     .200841               -.2813579    .5127398
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   0.5760
H0: diff = 0                                     Degrees of freedom =      141

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.7172         Pr(|T| > |t|) = 0.5655          Pr(T > t) = 0.2828

. // fail to reject both tests
. 
. /*testing if career_score and family_score
> are different for extrovert*/
. gen extrovert  = 0

. replace extrovert = 1 if personality_score > 3
(33 real changes made)

. 
. ttest career_score, by (extrovert)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
       0 |     110           4    .1049246    1.100459    3.792043    4.207957
       1 |      33    4.090909    .1760447      1.0113    3.732318      4.4495
---------+--------------------------------------------------------------------
Combined |     143    4.020979    .0901253    1.077742    3.842818     4.19914
---------+--------------------------------------------------------------------
    diff |           -.0909091    .2145299               -.5150201    .3332019
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -0.4238
H0: diff = 0                                     Degrees of freedom =      141

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.3362         Pr(|T| > |t|) = 0.6724          Pr(T > t) = 0.6638

. ttest family_score, by (extrovert)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
       0 |     110    2.872727    .1134118    1.189473    2.647949    3.097506
       1 |      33    2.939394    .2084366    1.197377    2.514822    3.363965
---------+--------------------------------------------------------------------
Combined |     143    2.888112    .0992957    1.187404    2.691823    3.084401
---------+--------------------------------------------------------------------
    diff |           -.0666667    .2364424               -.5340971    .4007638
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -0.2820
H0: diff = 0                                     Degrees of freedom =      141

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.3892         Pr(|T| > |t|) = 0.7784          Pr(T > t) = 0.6108

. // fail to reject both tests
. 
. gen very_introvert  = 0

. replace very_introvert = 1 if personality_score == 1
(13 real changes made)

. 
. ttest career_score, by (very_introvert)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
       0 |     130    4.076923    .0904605    1.031409    3.897945    4.255901
       1 |      13    3.461538    .3858953    1.391365    2.620745    4.302332
---------+--------------------------------------------------------------------
Combined |     143    4.020979    .0901253    1.077742    3.842818     4.19914
---------+--------------------------------------------------------------------
    diff |            .6153846    .3103134                .0019162    1.228853
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   1.9831
H0: diff = 0                                     Degrees of freedom =      141

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.9754         Pr(|T| > |t|) = 0.0493          Pr(T > t) = 0.0246

. /*successss
> means significant difference in career scores of
> very introvert and non very introvert*/
. 
. ttest family_score, by (very_introvert)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
       0 |     130    2.869231    .1026706    1.170625    2.666094    3.072367
       1 |      13    3.076923    .3833312     1.38212    2.241716     3.91213
---------+--------------------------------------------------------------------
Combined |     143    2.888112    .0992957    1.187404    2.691823    3.084401
---------+--------------------------------------------------------------------
    diff |           -.2076923    .3461817               -.8920699    .4766853
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -0.6000
H0: diff = 0                                     Degrees of freedom =      141

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.2748         Pr(|T| > |t|) = 0.5495          Pr(T > t) = 0.7252

. // fail to reject tests
. 
. // generating a varaible for upper classyear students who
. // have not changed their major
. gen uppclass_change = 0

. replace uppclass_change = 1 if (classyear < 2027 & major_change != "0")
(65 real changes made)

. 
. ttest career_score, by (uppclass_change)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
       0 |      78    4.051282    .1123381    .9921436    3.827588    4.274976
       1 |      65    3.984615     .146255    1.179146    3.692437    4.276793
---------+--------------------------------------------------------------------
Combined |     143    4.020979    .0901253    1.077742    3.842818     4.19914
---------+--------------------------------------------------------------------
    diff |            .0666667    .1815541               -.2922533    .4255867
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   0.3672
H0: diff = 0                                     Degrees of freedom =      141

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.6430         Pr(|T| > |t|) = 0.7140          Pr(T > t) = 0.3570

. ttest family_score, by (uppclass_change)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
       0 |      78    2.884615     .127713    1.127931    2.630306    3.138924
       1 |      65    2.892308     .156775    1.263961    2.579114    3.205502
---------+--------------------------------------------------------------------
Combined |     143    2.888112    .0992957    1.187404    2.691823    3.084401
---------+--------------------------------------------------------------------
    diff |           -.0076923     .200122               -.4033198    .3879352
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -0.0384
H0: diff = 0                                     Degrees of freedom =      141

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.4847         Pr(|T| > |t|) = 0.9694          Pr(T > t) = 0.5153

. ttest personality_score, by (uppclass_change)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
       0 |      78    2.794872    .1144838    1.011094    2.566905    3.022838
       1 |      65    2.692308    .1238856    .9987974    2.444818    2.939798
---------+--------------------------------------------------------------------
Combined |     143    2.748252    .0838997    1.003294    2.582398    2.914106
---------+--------------------------------------------------------------------
    diff |            .1025641    .1688727               -.2312858     .436414
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   0.6073
H0: diff = 0                                     Degrees of freedom =      141

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.7277         Pr(|T| > |t|) = 0.5446          Pr(T > t) = 0.2723

. //all tests failed
. 
. 
. ttest natural_science, by (international_num)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
       0 |      98    .4795918     .050725    .5021519    .3789167    .5802669
       1 |      45    .4666667    .0752101     .504525    .3150906    .6182428
---------+--------------------------------------------------------------------
Combined |     143    .4755245    .0419088     .501156    .3926788    .5583702
---------+--------------------------------------------------------------------
    diff |            .0129252    .0905576                -.166101    .1919513
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   0.1427
H0: diff = 0                                     Degrees of freedom =      141

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.5566         Pr(|T| > |t|) = 0.8867          Pr(T > t) = 0.4434

. //above test failed
. 
. 
. /*testing if career_score, personality_score and family_score
> are different for humanities majors*/
. gen humanities = 0

. replace humanities = 1 if division == "HU"
(7 real changes made)

. 
. ttest career_score, by (humanities)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
       0 |     136    4.036765    .0935898    1.091435    3.851673    4.221857
       1 |       7    3.714286    .2857143    .7559289    3.015168    4.413403
---------+--------------------------------------------------------------------
Combined |     143    4.020979    .0901253    1.077742    3.842818     4.19914
---------+--------------------------------------------------------------------
    diff |             .322479    .4182979               -.5044674    1.149425
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   0.7709
H0: diff = 0                                     Degrees of freedom =      141

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.7790         Pr(|T| > |t|) = 0.4420          Pr(T > t) = 0.2210

. ttest family_score, by (humanities)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
       0 |     136    2.867647    .1021601    1.191382    2.665606    3.069688
       1 |       7    3.285714      .42056    1.112697    2.256641    4.314788
---------+--------------------------------------------------------------------
Combined |     143    2.888112    .0992957    1.187404    2.691823    3.084401
---------+--------------------------------------------------------------------
    diff |           -.4180672    .4604866               -1.328418    .4922831
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -0.9079
H0: diff = 0                                     Degrees of freedom =      141

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.1827         Pr(|T| > |t|) = 0.3655          Pr(T > t) = 0.8173

. ttest personality_score, by (humanities)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
       0 |     136        2.75    .0865396    1.009217    2.578851    2.921149
       1 |       7    2.714286    .3595159    .9511897    1.834582    3.593989
---------+--------------------------------------------------------------------
Combined |     143    2.748252    .0838997    1.003294    2.582398    2.914106
---------+--------------------------------------------------------------------
    diff |            .0357143     .390211               -.7357061    .8071347
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   0.0915
H0: diff = 0                                     Degrees of freedom =      141

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.5364         Pr(|T| > |t|) = 0.9272          Pr(T > t) = 0.4636

. 
. 
. //all tests failed
. 
. /*testing if career_score, personality_score and family_score
> are different for social_science majors*/
. gen social_science = 0

. replace social_science = 1 if division == "SS"
(63 real changes made)

. 
. ttest career_score, by(social_science)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
       0 |      80      4.1125    .1052329     .941232    3.903039    4.321961
       1 |      63    3.904762    .1546585    1.227564    3.595604     4.21392
---------+--------------------------------------------------------------------
Combined |     143    4.020979    .0901253    1.077742    3.842818     4.19914
---------+--------------------------------------------------------------------
    diff |            .2077381    .1813387               -.1507562    .5662323
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   1.1456
H0: diff = 0                                     Degrees of freedom =      141

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.8730         Pr(|T| > |t|) = 0.2539          Pr(T > t) = 0.1270

. ttest family_score, by(social_science)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
       0 |      80        2.95    .1243973    1.112643    2.702393    3.197607
       1 |      63    2.809524    .1613708    1.280841    2.486948    3.132099
---------+--------------------------------------------------------------------
Combined |     143    2.888112    .0992957    1.187404    2.691823    3.084401
---------+--------------------------------------------------------------------
    diff |            .1404762    .2003688               -.2556393    .5365917
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   0.7011
H0: diff = 0                                     Degrees of freedom =      141

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.7578         Pr(|T| > |t|) = 0.4844          Pr(T > t) = 0.2422

. 
. ////////////////////////////////////
> ttest personality_score, by(social_science)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
       0 |      80      2.5625    .1065033    .9525947     2.35051     2.77449
       1 |      63    2.984127    .1289845    1.023783    2.726291    3.241963
---------+--------------------------------------------------------------------
Combined |     143    2.748252    .0838997    1.003294    2.582398    2.914106
---------+--------------------------------------------------------------------
    diff |            -.421627    .1658374               -.7494761   -.0937779
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -2.5424
H0: diff = 0                                     Degrees of freedom =      141

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0060         Pr(|T| > |t|) = 0.0121          Pr(T > t) = 0.9940

. // we can successfully reject the null hypothesis here
. 
. 
. ttest social_science, by(very_introvert)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
       0 |     130    .4615385    .0438921     .500447    .3746969    .5483801
       1 |      13    .2307692    .1216261     .438529   -.0342312    .4957697
---------+--------------------------------------------------------------------
Combined |     143    .4405594    .0416615    .4981993    .3582025    .5229164
---------+--------------------------------------------------------------------
    diff |            .2307692    .1441284               -.0541628    .5157013
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   1.6011
H0: diff = 0                                     Degrees of freedom =      141

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.9442         Pr(|T| > |t|) = 0.1116          Pr(T > t) = 0.0558

. ttest social_science, by(female_num)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
       0 |      87    .3908046    .0526149    .4907593    .2862096    .4953996
       1 |      56    .5178571     .067377    .5042031    .3828307    .6528836
---------+--------------------------------------------------------------------
Combined |     143    .4405594    .0416615    .4981993    .3582025    .5229164
---------+--------------------------------------------------------------------
    diff |           -.1270525     .084984                 -.29506    .0409549
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -1.4950
H0: diff = 0                                     Degrees of freedom =      141

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0686         Pr(|T| > |t|) = 0.1371          Pr(T > t) = 0.9314

. 
. ttest natural_science, by(female_num)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
       0 |      87    .5287356    .0538273    .5020674    .4217306    .6357407
       1 |      56    .3928571    .0658539    .4928054     .260883    .5248313
---------+--------------------------------------------------------------------
Combined |     143    .4755245    .0419088     .501156    .3926788    .5583702
---------+--------------------------------------------------------------------
    diff |            .1358785       .0854               -.0329514    .3047084
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   1.5911
H0: diff = 0                                     Degrees of freedom =      141

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.9431         Pr(|T| > |t|) = 0.1138          Pr(T > t) = 0.0569

. 
. ttest natural_science, by(international_num)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
       0 |      98    .4795918     .050725    .5021519    .3789167    .5802669
       1 |      45    .4666667    .0752101     .504525    .3150906    .6182428
---------+--------------------------------------------------------------------
Combined |     143    .4755245    .0419088     .501156    .3926788    .5583702
---------+--------------------------------------------------------------------
    diff |            .0129252    .0905576                -.166101    .1919513
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   0.1427
H0: diff = 0                                     Degrees of freedom =      141

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.5566         Pr(|T| > |t|) = 0.8867          Pr(T > t) = 0.4434

. 
. gen high_career_inf = 0

. replace high_career_inf =1 if career_score > 3
(110 real changes made)

. 
. ttest social_science, by(high_career_inf)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
       0 |      33    .5454545    .0880223    .5056499    .3661589    .7247502
       1 |     110    .4090909    .0470931    .4939163     .315754    .5024278
---------+--------------------------------------------------------------------
Combined |     143    .4405594    .0416615    .4981993    .3582025    .5229164
---------+--------------------------------------------------------------------
    diff |            .1363636    .0985654               -.0584934    .3312207
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   1.3835
H0: diff = 0                                     Degrees of freedom =      141

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.9156         Pr(|T| > |t|) = 0.1687          Pr(T > t) = 0.0844

. ttest natural_science, by(high_career_inf)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
       0 |      33    .3333333    .0833333    .4787136    .1635889    .5030778
       1 |     110    .5181818    .0478596    .5019561    .4233256    .6130381
---------+--------------------------------------------------------------------
Combined |     143    .4755245    .0419088     .501156    .3926788    .5583702
---------+--------------------------------------------------------------------
    diff |           -.1848485    .0985998               -.3797735    .0100765
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -1.8747
H0: diff = 0                                     Degrees of freedom =      141

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0314         Pr(|T| > |t|) = 0.0629          Pr(T > t) = 0.9686

. 
. gen low_career_inf = 0

. replace low_career_inf =1 if career_score < 3
(15 real changes made)

. 
. ttest social_science, by(low_career_inf)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
       0 |     128    .4140625    .0437076    .4944948    .3275731    .5005519
       1 |      15    .6666667    .1259882      .48795    .3964489    .9368844
---------+--------------------------------------------------------------------
Combined |     143    .4405594    .0416615    .4981993    .3582025    .5229164
---------+--------------------------------------------------------------------
    diff |           -.2526042    .1347757               -.5190464    .0138381
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -1.8743
H0: diff = 0                                     Degrees of freedom =      141

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0315         Pr(|T| > |t|) = 0.0630          Pr(T > t) = 0.9685

. ttest natural_science, by(low_career_inf)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
       0 |     128    .4921875    .0443624    .5019034    .4044023    .5799727
       1 |      15    .3333333    .1259882      .48795    .0631156    .6035511
---------+--------------------------------------------------------------------
Combined |     143    .4755245    .0419088     .501156    .3926788    .5583702
---------+--------------------------------------------------------------------
    diff |            .1588542    .1366005               -.1111956    .4289039
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   1.1629
H0: diff = 0                                     Degrees of freedom =      141

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.8766         Pr(|T| > |t|) = 0.2468          Pr(T > t) = 0.1234

. 
. gen high_family_inf = 0

. replace high_family_inf =1 if family_score > 2
(85 real changes made)

. ttest social_science, by(high_family_inf)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
       0 |      58          .5    .0662266    .5043669    .3673835    .6326165
       1 |      85          .4    .0534522    .4928054    .2937043    .5062957
---------+--------------------------------------------------------------------
Combined |     143    .4405594    .0416615    .4981993    .3582025    .5229164
---------+--------------------------------------------------------------------
    diff |                  .1    .0847321               -.0675095    .2675095
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   1.1802
H0: diff = 0                                     Degrees of freedom =      141

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.8800         Pr(|T| > |t|) = 0.2399          Pr(T > t) = 0.1200

. ttest natural_science, by(high_family_inf)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
       0 |      58    .4655172    .0660689     .503166    .3332165     .597818
       1 |      85    .4823529    .0545205     .502654     .373933    .5907729
---------+--------------------------------------------------------------------
Combined |     143    .4755245    .0419088     .501156    .3926788    .5583702
---------+--------------------------------------------------------------------
    diff |           -.0168357    .0856431               -.1861463    .1524749
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -0.1966
H0: diff = 0                                     Degrees of freedom =      141

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.4222         Pr(|T| > |t|) = 0.8444          Pr(T > t) = 0.5778

. 
. 
. regress personality_score natural_science social_science humanities

      Source |       SS           df       MS      Number of obs   =       143
-------------+----------------------------------   F(3, 139)       =      2.31
       Model |  6.78318805         3  2.26106268   Prob > F        =    0.0792
    Residual |  136.153875       139   .97952428   R-squared       =    0.0475
-------------+----------------------------------   Adj R-squared   =    0.0269
       Total |  142.937063       142  1.00659903   Root MSE        =    .98971

---------------------------------------------------------------------------------
personality_s~e | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
natural_science |  -.2705882   .4585953    -0.59   0.556    -1.177313    .6361361
 social_science |    .184127     .45984     0.40   0.689    -.7250585    1.093312
     humanities |  -.0857143   .5795144    -0.15   0.883    -1.231517    1.060089
          _cons |        2.8   .4426114     6.33   0.000     1.924879    3.675121
---------------------------------------------------------------------------------

. // the varaibles are not statistically significant
. 
. regress career_score very_introvert

      Source |       SS           df       MS      Number of obs   =       143
-------------+----------------------------------   F(1, 141)       =      3.93
       Model |  4.47552448         1  4.47552448   Prob > F        =    0.0493
    Residual |  160.461538       141   1.1380251   R-squared       =    0.0271
-------------+----------------------------------   Adj R-squared   =    0.0202
       Total |  164.937063       142  1.16152861   Root MSE        =    1.0668

--------------------------------------------------------------------------------
  career_score | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
very_introvert |  -.6153846   .3103134    -1.98   0.049    -1.228853   -.0019162
         _cons |   4.076923    .093563    43.57   0.000     3.891955    4.261891
--------------------------------------------------------------------------------

. 
. regress career_score family_score very_introvert 

      Source |       SS           df       MS      Number of obs   =       143
-------------+----------------------------------   F(2, 140)       =     10.34
       Model |  21.2315461         2   10.615773   Prob > F        =    0.0001
    Residual |  143.705517       140  1.02646798   R-squared       =    0.1287
-------------+----------------------------------   Adj R-squared   =    0.1163
       Total |  164.937063       142  1.16152861   Root MSE        =    1.0131

--------------------------------------------------------------------------------
  career_score | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
  family_score |   .2896653   .0716941     4.04   0.000     .1479221    .4314084
very_introvert |  -.6755459   .2950876    -2.29   0.024     -1.25895   -.0921418
         _cons |   3.245807   .2240788    14.49   0.000     2.802791    3.688822
--------------------------------------------------------------------------------

. 
. gen very_extr = 0

. replace very_extr =1 if personality_score > 3
(33 real changes made)

. regress career_score family_score international_num female_num social_science very_intr
> overt very_extr

      Source |       SS           df       MS      Number of obs   =       143
-------------+----------------------------------   F(6, 136)       =      3.94
       Model |  24.4012015         6  4.06686691   Prob > F        =    0.0012
    Residual |  140.535861       136  1.03335192   R-squared       =    0.1479
-------------+----------------------------------   Adj R-squared   =    0.1104
       Total |  164.937063       142  1.16152861   Root MSE        =    1.0165

-----------------------------------------------------------------------------------
     career_score | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
------------------+----------------------------------------------------------------
     family_score |    .286951   .0734831     3.90   0.000     .1416336    .4322684
international_num |  -.1340175   .1862333    -0.72   0.473    -.5023052    .2342702
       female_num |  -.1491551   .1807453    -0.83   0.411      -.50659    .2082797
   social_science |  -.2080047   .1757923    -1.18   0.239    -.5556448    .1396353
   very_introvert |  -.7483751   .3066985    -2.44   0.016     -1.35489   -.1418602
        very_extr |    .013035   .2070841     0.06   0.950    -.3964864    .4225565
            _cons |   3.449481   .2595264    13.29   0.000     2.936251     3.96271
-----------------------------------------------------------------------------------

. 
. 
. gen high_mjr_change = 0

. replace high_mjr_change = 1 if (major_change != "0" & major_change != "1")
(33 real changes made)

. 
. 
. ttest career_score, by (high_mjr_change)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
       0 |     110    3.972727    .1084111    1.137026     3.75786    4.187595
       1 |      33    4.181818    .1472896    .8461141    3.881799    4.481837
---------+--------------------------------------------------------------------
Combined |     143    4.020979    .0901253    1.077742    3.842818     4.19914
---------+--------------------------------------------------------------------
    diff |           -.2090909    .2139431               -.6320417    .2138599
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -0.9773
H0: diff = 0                                     Degrees of freedom =      141

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.1650         Pr(|T| > |t|) = 0.3301          Pr(T > t) = 0.8350

. ttest family_score, by (high_mjr_change)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
       0 |     110    2.845455    .1142013    1.197753    2.619111    3.071798
       1 |      33    3.030303    .2017201    1.158794    2.619413    3.441193
---------+--------------------------------------------------------------------
Combined |     143    2.888112    .0992957    1.187404    2.691823    3.084401
---------+--------------------------------------------------------------------
    diff |           -.1848485    .2359962               -.6513968    .2816998
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -0.7833
H0: diff = 0                                     Degrees of freedom =      141

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.2174         Pr(|T| > |t|) = 0.4348          Pr(T > t) = 0.7826

. ttest personality_score, by (high_mjr_change)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
       0 |     110    2.736364    .0980862    1.028736     2.54196    2.930767
       1 |      33    2.787879    .1614188    .9272802     2.45908    3.116678
---------+--------------------------------------------------------------------
Combined |     143    2.748252    .0838997    1.003294    2.582398    2.914106
---------+--------------------------------------------------------------------
    diff |           -.0515152    .1997907               -.4464876    .3434573
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -0.2578
H0: diff = 0                                     Degrees of freedom =      141

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.3985         Pr(|T| > |t|) = 0.7969          Pr(T > t) = 0.6015

. ttest natural_science, by(high_mjr_change)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
       0 |     110    .4727273      .04782    .5015406    .3779496     .567505
       1 |      33    .4848485    .0883478    .5075192      .30489     .664807
---------+--------------------------------------------------------------------
Combined |     143    .4755245    .0419088     .501156    .3926788    .5583702
---------+--------------------------------------------------------------------
    diff |           -.0121212    .0998159               -.2094503    .1852079
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -0.1214
H0: diff = 0                                     Degrees of freedom =      141

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.4518         Pr(|T| > |t|) = 0.9035          Pr(T > t) = 0.5482

. ttest social_science, by(high_mjr_change)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
       0 |     110    .4545455     .047693    .5002085    .3600195    .5490714
       1 |      33    .3939394    .0863769    .4961977    .2179954    .5698834
---------+--------------------------------------------------------------------
Combined |     143    .4405594    .0416615    .4981993    .3582025    .5229164
---------+--------------------------------------------------------------------
    diff |            .0606061    .0991008               -.1353094    .2565216
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   0.6116
H0: diff = 0                                     Degrees of freedom =      141

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.7291         Pr(|T| > |t|) = 0.5418          Pr(T > t) = 0.2709

. ttest female_num, by(high_mjr_change)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
       0 |     110    .3727273    .0463138    .4857434    .2809348    .4645197
       1 |      33    .4545455    .0880223    .5056499    .2752498    .6338411
---------+--------------------------------------------------------------------
Combined |     143    .3916084    .0409613    .4898256    .3106357    .4725811
---------+--------------------------------------------------------------------
    diff |           -.0818182    .0973206               -.2742144    .1105781
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -0.8407
H0: diff = 0                                     Degrees of freedom =      141

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.2010         Pr(|T| > |t|) = 0.4019          Pr(T > t) = 0.7990

. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
end of do-file

. do "/var/folders/77/r2kbz41j5hz_44s8bp00q04m0000gn/T//SD54263.000000"

. regress career_score family_score international_num female_num social_science very_intr
> overt very_extr

      Source |       SS           df       MS      Number of obs   =       143
-------------+----------------------------------   F(6, 136)       =      3.94
       Model |  24.4012015         6  4.06686691   Prob > F        =    0.0012
    Residual |  140.535861       136  1.03335192   R-squared       =    0.1479
-------------+----------------------------------   Adj R-squared   =    0.1104
       Total |  164.937063       142  1.16152861   Root MSE        =    1.0165

-----------------------------------------------------------------------------------
     career_score | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
------------------+----------------------------------------------------------------
     family_score |    .286951   .0734831     3.90   0.000     .1416336    .4322684
international_num |  -.1340175   .1862333    -0.72   0.473    -.5023052    .2342702
       female_num |  -.1491551   .1807453    -0.83   0.411      -.50659    .2082797
   social_science |  -.2080047   .1757923    -1.18   0.239    -.5556448    .1396353
   very_introvert |  -.7483751   .3066985    -2.44   0.016     -1.35489   -.1418602
        very_extr |    .013035   .2070841     0.06   0.950    -.3964864    .4225565
            _cons |   3.449481   .2595264    13.29   0.000     2.936251     3.96271
-----------------------------------------------------------------------------------

. 
end of do-file

